blog/app/controllers/articles_controller.rb

  def create

    @article = Article.new(params.require(:article).permit(:title, :text))

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Msg"], ["text", "hi"], ["created_at", "2018-06-22 17:32:20.873330"], ["updated_at", "2018-06-22 17:32:20.873330"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(params.require(:article).permit(:title, :text))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "edited"], ["updated_at", "2018-06-22 17:58:59.974517"], ["id", 6]]